src/cf/DataProcessors/уатПланированиеРаботыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>уатПланированиеРаботыТС</Name>
			<Comment>(уат)</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/уатСостояниеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСостояниеТС</Name>
			<Comment>Состояние ТС (уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостояниеТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагрузкаПоВесу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагрузкаПоОбъему</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>Транспортное средство</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатВидыМоделейТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыМоделейТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автотранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прицеп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвиационныйТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорскойТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатДиспозицияТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатДиспозицияТС</Name>
			<BasedOn>
				<xr:Item>Document.уатДислокацияВагонов</xr:Item>
				<xr:Item>Document.уатНатурныйЛист</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.уатСостояниеТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Comment>Заказ</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостояниеТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатДислокацияВагонов</v8:Type>
						<v8:Type>cfg:DocumentRef.уатНатурныйЛист</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокТССтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСостояниеТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Comment>Дата начала</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Дата окончания</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/уатСостояниеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатСостояниеТС</Name>
			<Comment>Состояния ТС (уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРабочегоВремениПростоя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСостояния</Name>
					<Comment>Вид состояния ТС</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыСостоянийТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаВодителю</Name>
					<Comment>Признак оплаты водителю</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаКлиента</Name>
					<Comment>Признак оплаты клиентом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВыпискуДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УменьшатьПростойНаВремяОбеда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветСостояния</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/уатПланированиеРаботыТС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		ВызватьИсключение НСтр("ru = 'Не поддерживается в мобильном клиенте.'; en = 'Not supported in mobile client.'")
	КонецЕсли;

	// начало блока стандартных операций
	ДопПараметрыОткрытие = Новый Структура("ИмяФормы", ИмяФормы);
	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	// конец блока стандартных операций
	
	ЗагрузитьНастройки();
	ПользовательВиделПредупреждение = Ложь;
	ЗагрузитьНастройкиФормы(ПользовательВиделПредупреждение, ФлажокЛегенда);
	ЗагрузитьНастройкиВариантаОтчета();
	НастроитьОтборПоВидамМоделейТС();
	ДиаграммаГанта.ОтображатьЗаголовок = Ложь;
	ДиаграммаГанта.ОтображатьЛегенду = Ложь;
	ДиаграммаГанта.ОбластьПостроения.Право = 1;
	ДиаграммаГанта.ОбластьПостроения.Заголовок = НСтр("en='Vehicle / Condition';ru='ТС / Состояние'");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	// начало блока стандартных операций
	уатЗащищенныеФункцииКлиент.уатОбработкаФормаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// конец блока стандартных операций
	
	ОтображатьОборудованиеПрицепы = Истина;  
	ТекРелизПлатформы = ПолучитьТекРелизПлатформы();
	УстановитьВариантИнтерфейса(ТекРелизПлатформы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзмененоСостояниеТС" Тогда
		СформироватьОтчет();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура ВариантПросмотраДиаграммыПриИзменении(Элемент)
	ТекЭлементыОтбора = НастройкиКомпоновки.Настройки.Отбор.Элементы;	
	ЗагрузитьНастройкиВариантаОтчета(); 
	ПеренестиНастройкиОтбораПриСменеВариантаОтчета(ТекЭлементыОтбора);
	СформироватьОтчет();
	Если ВариантПросмотраДиаграммы = 0 Тогда
		СвернутьВсеТочкиДиаграммаГанта();
	КонецЕсли;
	Элементы.ГруппаКомандыГанта.Видимость      = ВариантПросмотраДиаграммы = 0;
	Элементы.ГруппаКомандыГанта1.Видимость     = ВариантПросмотраДиаграммы = 0;
	//ЭтаФорма.ДиаграммаГанта.ОтображатьЛегенду  = ВариантПросмотраДиаграммы = 1;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	СформироватьОтчет();
	СвернутьВсеТочкиДиаграммаГанта();
КонецПроцедуры

&НаКлиенте
Процедура ФлажокНеактивныеТСПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры 

&НаКлиенте
Процедура ФлажокВыбывшиеТСПриИзменении(Элемент)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаГанта1ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ИспользуетсяНовыйИнтерфейс Тогда
		Если ВыбраннаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если ВариантПросмотраДиаграммы = 0 Тогда
			Если ПустаяСтрока(Элемент.ДанныеСтроки(ВыбраннаяСтрока).Текст) Тогда
				ТекстПоиска = Элемент.ДанныеСтроки(ВыбраннаяСтрока).Точка;
			ИначеЕсли Не ПустаяСтрока(Элемент.ДанныеСтроки(ВыбраннаяСтрока).Текст) И Поле.Заголовок = "ТС / Состояние" Тогда
				ТекстПоиска = Элемент.ДанныеСтроки(ВыбраннаяСтрока).Точка;
			Иначе
				ТекстПоиска = Элемент.ДанныеСтроки(ВыбраннаяСтрока).Текст;
			КонецЕсли;
		Иначе
			ТекстПоиска = ?(Поле.Заголовок = "ТС / Состояние", Элемент.ДанныеСтроки(ВыбраннаяСтрока).Точка, 
				Элемент.ДанныеСтроки(ВыбраннаяСтрока).Текст);
		КонецЕсли;
		ОткрываемаяСсылка = СоответствиеСтрокаСсылка.НайтиСтроки(Новый Структура("Строка", ТекстПоиска))[0].Ссылка;
		Если ТипЗнч(ОткрываемаяСсылка) = Тип("СписокЗначений") Тогда
			ОткрываемаяСсылка.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПоказатьВыборСсылкиЗавершение", ЭтотОбъект));
		ИначеЕсли ОткрываемаяСсылка <> Неопределено Тогда
			ПоказатьЗначение(, ОткрываемаяСсылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаГантаВыбор(Элемент, Значения, СтандартнаяОбработка, ТекДата)
	Если ТекДата <> Неопределено Тогда
		Если ТипЗнч(Значения) = Тип("ЗначениеДиаграммыГанта") Тогда
			Если ТипЗнч(Значения.Точка.Расшифровка) = Тип("СправочникСсылка.уатТС") Тогда
				СписокВыбораДокумента = Новый СписокЗначений;
				СписокВыбораДокумента.Добавить(1, НСтр("en='Vehicle disposition';ru='Диспозиция ТС'"));
				СписокВыбораДокумента.Добавить(2, НСтр("en='Job sheet to release vehicle';ru='Разнарядка на выпуск ТС'"));
				СписокВыбораДокумента.Добавить(3, НСтр("en='Repair list';ru='Ремонтный лист'"));
				СписокВыбораДокумента.Добавить(4, НСтр("en='Waybill';ru='Путевой лист'"));
				СписокВыбораДокумента.Добавить(5, НСтр("en='Order for repair';ru='Заявка на ремонт'"));
				СписокВыбораДокумента.Добавить(6, НСтр("en='Routing list';ru='Маршрутный лист'"));
				ВыбЭлемент = Неопределено;

				СписокВыбораДокумента.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ДиаграммаГантаВыборЗавершение1", ЭтотОбъект, Новый Структура("Значения, ТекДата", Значения, ТекДата)), НСтр("en='Create document';ru='Создать документ'"));
				
			ИначеЕсли ТипЗнч(Значения.Точка.Расшифровка) = Тип("СправочникСсылка.уатСостояниеТС") Тогда
				СписокВыбораДокумента = Новый СписокЗначений;
				Если Значения.Точка.Расшифровка = ПредопределенноеЗначение("Справочник.уатСостояниеТС.СформированПутевойЛист") Тогда
					СписокВыбораДокумента.Добавить(4, НСтр("en='Waybill';ru='Путевой лист'"));
					СписокВыбораДокумента.Добавить(2, НСтр("en='Daily vehicles plan';ru='Разнарядка на выпуск ТС'"));
					СписокВыбораДокумента.Добавить(1, НСтр("en='Vehicle disposition';ru='Диспозиция ТС'"));
				ИначеЕсли Значения.Точка.Расшифровка = ПредопределенноеЗначение("Справочник.уатСостояниеТС.СформированаРазнарядка") Тогда
					СписокВыбораДокумента.Добавить(2, НСтр("en='Daily vehicles plan';ru='Разнарядка на выпуск ТС'"));
					СписокВыбораДокумента.Добавить(1, НСтр("en='Vehicle disposition';ru='Диспозиция ТС'"));
				ИначеЕсли Значения.Точка.Расшифровка = ПредопределенноеЗначение("Справочник.уатСостояниеТС.НаКапитальномРемонте")
					ИЛИ Значения.Точка.Расшифровка = ПредопределенноеЗначение("Справочник.уатСостояниеТС.НаСреднемРемонте")
					ИЛИ Значения.Точка.Расшифровка = ПредопределенноеЗначение("Справочник.уатСостояниеТС.НаТекущемРемонте") Тогда
					СписокВыбораДокумента.Добавить(3, НСтр("en='Repair list';ru='Ремонтный лист'"));
					СписокВыбораДокумента.Добавить(1, НСтр("en='Vehicle disposition';ru='Диспозиция ТС'"));
				Иначе //создаем сразу диспозицию
					СоздатьНовыйДокумент(1, ТекДата, ТекДата + 3600, Значения.Точка.Родитель.Расшифровка, Значения.Точка.Расшифровка);
					Возврат;
				КонецЕсли;
				
				СписокВыбораДокумента.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ДиаграммаГантаВыборЗавершение", ЭтотОбъект, Новый Структура("Значения, ТекДата", Значения, ТекДата)), НСтр("en='Create document';ru='Создать документ'"));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаГантаВыборЗавершение1(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Значения = ДополнительныеПараметры.Значения;
    ТекДата = ДополнительныеПараметры.ТекДата;
    
    
    ВыбЭлемент = ВыбранныйЭлемент;
    Если ВыбЭлемент <> Неопределено Тогда
        СоздатьНовыйДокумент(ВыбЭлемент.Значение, ТекДата, ТекДата + 3600, Значения.Точка.Расшифровка);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаГантаВыборЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    Значения = ДополнительныеПараметры.Значения;
    ТекДата = ДополнительныеПараметры.ТекДата;
    
    
    ВыбЭлемент = ВыбранныйЭлемент;
    Если ВыбЭлемент <> Неопределено Тогда
        СоздатьНовыйДокумент(ВыбЭлемент.Значение, ТекДата, ТекДата + 3600, Значения.Точка.Родитель.Расшифровка, Значения.Точка.Расшифровка);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекОтбораНастройкиОтборПриИзменении(Элемент)
	СинхронизироватьОтборы(Элемент.ТекущиеДанные);
КонецПроцедуры  

&НаКлиенте
Процедура ОтображатьОборудованиеПрицепыПриИзменении(Элемент)
	
	МассивОтображаемыхВидовТС = Новый Массив();
	Если ОтображатьОборудованиеПрицепы Тогда
		МассивОтображаемыхВидовТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.АвиационныйТранспорт"));
		МассивОтображаемыхВидовТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Автотранспорт"));
		МассивОтображаемыхВидовТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.ЖДТранспорт"));
		МассивОтображаемыхВидовТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.МорскойТранспорт"));
		МассивОтображаемыхВидовТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Оборудование"));
		МассивОтображаемыхВидовТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Прицеп"));
	Иначе
		МассивОтображаемыхВидовТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.АвиационныйТранспорт"));
		МассивОтображаемыхВидовТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Автотранспорт"));
		МассивОтображаемыхВидовТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.ЖДТранспорт"));
		МассивОтображаемыхВидовТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.МорскойТранспорт"));	
	КонецЕсли;
	МассивМоделейТСОтбор.ЗагрузитьЗначения(МассивОтображаемыхВидовТС);
	
	ЭлементыОтбора = НастройкиКомпоновки.Настройки.Отбор.Элементы;  
		
	Для Каждого Элемент Из ЭлементыОтбора Цикл 
		
		Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидМоделиТС") Тогда  
			
			Элемент.ПравоеЗначение = МассивМоделейТСОтбор;
			Элемент.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке; 
			Элемент.Использование  = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СформироватьОтчет();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПериод(Команда)
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериода.Период.ДатаНачала = ДатаНач;
	ДиалогПериода.Период.ДатаОкончания = ДатаКон;
	ДиалогПериода.Показать(Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт
    
    Если Не Период = Неопределено Тогда
        ДатаНач = Период.ДатаНачала;
        ДатаКон = Период.ДатаОкончания;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	СформироватьОтчет();
	РазвернутьПравуюТЧ();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	СписокВыбораДокумента = Новый СписокЗначений;
	Если ДобавитьВСписокСозданияДокументов("уатДиспозицияТС") Тогда
		СписокВыбораДокумента.Добавить(1, НСтр("en='Vehicle disposition';ru='Диспозиция ТС'"));
	КонецЕсли;
	Если ДобавитьВСписокСозданияДокументов("уатРазнарядка") Тогда
		СписокВыбораДокумента.Добавить(2, НСтр("en='Daily vehicles plan';ru='Разнарядка на выпуск ТС'"));
	КонецЕсли;
	Если ДобавитьВСписокСозданияДокументов("уатРемонтныйЛист") Тогда
		СписокВыбораДокумента.Добавить(3, НСтр("en='Repair list';ru='Ремонтный лист'"));
	КонецЕсли;
	Если ДобавитьВСписокСозданияДокументов("уатПутевойЛист") Тогда
		СписокВыбораДокумента.Добавить(4, НСтр("en='Waybill';ru='Путевой лист'"));
	КонецЕсли;
	Если ДобавитьВСписокСозданияДокументов("уатЗаявкаНаРемонт") Тогда
		СписокВыбораДокумента.Добавить(5, НСтр("en='Order for repair';ru='Заявка на ремонт'"));
	КонецЕсли;
	Если ДобавитьВСписокСозданияДокументов("уатМаршрутныйЛист") Тогда
		СписокВыбораДокумента.Добавить(6, НСтр("en='Routing list';ru='Маршрутный лист'"));
	КонецЕсли;
	Если ДобавитьВСписокСозданияДокументов("такЗаказТакси") Тогда
		СписокВыбораДокумента.Добавить(7, НСтр("en='Taxi order';ru='Заказ такси'"));
	КонецЕсли; 
	Если ДобавитьВСписокСозданияДокументов("такАрендаТС") Тогда
		СписокВыбораДокумента.Добавить(8, НСтр("en='Vehicle rental';ru='Аренда ТС'"));
	КонецЕсли;
	ВыбЭлемент = Неопределено;

	СписокВыбораДокумента.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("СоздатьДокументЗавершение", ЭтотОбъект), НСтр("en='Create document';ru='Создать документ'"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    ВыбЭлемент = ВыбранныйЭлемент;
    Если ВыбЭлемент <> Неопределено Тогда
        ТекТС = Неопределено;
        ТекСостояние = Неопределено; 
		Если Элементы.ДеревоСостояний.ТекущиеДанные <> Неопределено Тогда
        	ТекСтрокаДерева = Элементы.ДеревоСостояний.ТекущиеДанные;
			Иначе Если Элементы.ДиаграммаГанта1Таблица.ТекущиеДанные <> Неопределено Тогда
				ТекСтрокаДерева = Новый Структура;   
				ЗначениеДиаграммыГанта = ДиаграммаГанта.НайтиЗначениеПоИдентификатору(Элементы.ДиаграммаГанта1Таблица.ТекущаяСтрока);
				// Если позиционирование на состоянии то заполнять ТС из Родителя
				Если ЗначениеДиаграммыГанта.Точка.Родитель <> Неопределено Тогда
					ТекТС = ЗначениеДиаграммыГанта.Точка.Родитель.Расшифровка;
					ТекСостояние = ЗначениеДиаграммыГанта.Точка.Расшифровка;
				Иначе
					ТекТС = ЗначениеДиаграммыГанта.Точка.Расшифровка;
					ТекСостояние = Неопределено;
				КонецЕсли;
				ТекСтрокаДерева.Вставить("ТС", ТекТС);
				ТекСтрокаДерева.Вставить("Состояние", ТекСостояние);
			КонецЕсли;
		КонецЕсли;
        Если ТекСтрокаДерева <> Неопределено Тогда
            ТекТС = ТекСтрокаДерева.ТС;
            ТекСостояние = ТекСтрокаДерева.Состояние;
        КонецЕсли;
        
        СоздатьНовыйДокумент(ВыбЭлемент.Значение, , , ТекТС, ТекСостояние);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйДокумент(ВидДокумента, Знач НачалоПериода = Неопределено, Знач ОкончаниеПериода = Неопределено, Знач ТекТС = Неопределено, Знач ТекСостояние = Неопределено)
	Если НачалоПериода = Неопределено Тогда
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	Если ОкончаниеПериода = Неопределено Тогда
		ОкончаниеПериода = КонецДня(НачалоПериода);
	КонецЕсли;
		
	Если ВидДокумента = 1 Тогда //Диспозиция ТС
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Дата, Организация, ТС, Состояние, ДатаНачала, ДатаОкончания",
			НачалоПериода, Организация, ТекТС, ТекСостояние, НачалоПериода, ОкончаниеПериода));
		ОткрытьФорму("Документ.уатДиспозицияТС.ФормаОбъекта", ПараметрыФормы);
		
	ИначеЕсли ВидДокумента = 2 Тогда //Разнарядка
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Дата, Организация, НоваяСтрока",
			НачалоПериода, Организация, Новый Структура("ТС, ДатаВыезда, ДатаВозвращения", ТекТС, НачалоПериода, ОкончаниеПериода)));
		ОткрытьФорму("Документ.уатРазнарядка.ФормаОбъекта", ПараметрыФормы);
		
	ИначеЕсли ВидДокумента = 3 Тогда //РЛ
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Дата, Организация, ТС, ДатаНачала, ДатаОкончания",
			НачалоПериода, Организация, ТекТС, НачалоПериода, ОкончаниеПериода));
		ОткрытьФорму("Документ.уатРемонтныйЛист.ФормаОбъекта", ПараметрыФормы);
		
	ИначеЕсли ВидДокумента = 4 Тогда //ПЛ
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Дата, Организация, ТранспортноеСредство, ДатаВыезда, ДатаВозвращения",
			НачалоПериода, Организация, ТекТС, НачалоПериода, ОкончаниеПериода));
		ОткрытьФорму("Документ.уатПутевойЛист.ФормаОбъекта", ПараметрыФормы);  
		
	ИначеЕсли ВидДокумента = 5 Тогда // Заявка на ремонт 
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Дата, Организация, ТС, ДатаНачала, ДатаОкончания",
			НачалоПериода, Организация, ТекТС, НачалоПериода, ОкончаниеПериода));
		ОткрытьФорму("Документ.уатЗаявкаНаРемонт.ФормаОбъекта", ПараметрыФормы);
		
	ИначеЕсли ВидДокумента = 6 Тогда // МЛ  
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Дата, Организация, ТС",
			НачалоПериода, Организация, ТекТС));
		ОткрытьФорму("Документ.уатМаршрутныйЛист.ФормаОбъекта", ПараметрыФормы);
		
	ИначеЕсли ВидДокумента = 7 Тогда  
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Дата, Организация, ТС, ВремяПодачи, ВремяОкончанияПлановое",
			НачалоПериода, Организация, ТекТС, НачалоПериода, ОкончаниеПериода));
		ОткрытьФорму("Документ.такЗаказТакси.ФормаОбъекта", ПараметрыФормы);
		
	ИначеЕсли ВидДокумента = 8 Тогда  
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Дата, Организация, ТС, ДатаНачалаПлановая, ДатаОкончанияПлановая",
			НачалоПериода, Организация, ТекТС, НачалоПериода, ОкончаниеПериода));
		ОткрытьФорму("Документ.такАрендаТС.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСостоянийПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	Попытка
		ТекСтрока = Элементы.ДеревоСостояний.ТекущиеДанные;
		Если ТекСтрока.Уровень = 1 Тогда
			ПоказатьЗначение(Неопределено, ТекСтрока.ТС);
		ИначеЕсли ТекСтрока.Уровень = 2 Тогда
			ПоказатьЗначение(Неопределено, ТекСтрока.Состояние);
		ИначеЕсли ТекСтрока.Уровень = 3 Тогда
			Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
				ПоказатьЗначение(Неопределено, ТекСтрока.Документ);
			Иначе
				Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
					И (ТипЗнч(ТекСтрока.Документ) = Тип("ДокументСсылка.такЗаказТакси")
					ИЛИ ТипЗнч(ТекСтрока.Документ) = Тип("ДокументСсылка.такАрендаТС")) Тогда
					ТекСтрока.Документ = Неопределено; 
				КонецЕсли;
				ПоказатьЗначение(Неопределено, ТекСтрока.Документ);
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеТочкиДиаграммаГанта(Команда)
	Если ИспользуетсяНовыйИнтерфейс Тогда
		СвернутьРазвернутьНаСервере();
		КоличествоТочек = ДиаграммаГанта.Точки.Количество();
		Если ЗначениеЗаполнено(КоличествоТочек) Тогда
			Для Каждого Точка Из ДиаграммаГанта.Точки Цикл
				Если Точка.Точки.Количество() <> 0 Тогда
					ЗначениеДиаграммы = ДиаграммаГанта.ПолучитьЗначение(Точка, ДиаграммаГанта.Серии[0]);
					Элементы.ДиаграммаГанта1Таблица.Развернуть(ЗначениеДиаграммы.Идентификатор, Истина);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Для каждого Точка Из ДиаграммаГанта.Точки Цикл
			ДиаграммаГанта.РазвернутьТочку(Точка, Истина);
		КонецЦикла;
		Для каждого Ид Из ДеревоСостояний.ПолучитьЭлементы() Цикл
			Элементы.ДеревоСостояний.Развернуть(Ид.ПолучитьИдентификатор(), Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсеТочкиДиаграммаГанта(Команда = Ложь)
	Если ИспользуетсяНовыйИнтерфейс Тогда
		Сч = 0;
		КоличествоТочек = ДиаграммаГанта.Точки.Количество();
		Если ЗначениеЗаполнено(КоличествоТочек) Тогда
			Пока Сч < КоличествоТочек Цикл
				Если ДиаграммаГанта.Точки[Сч].Точки.Количество() <> 0 Тогда
					ЗначениеДиаграммы = ДиаграммаГанта.ПолучитьЗначение(ДиаграммаГанта.Точки[Сч], ДиаграммаГанта.Серии[0]);
					Элементы.ДиаграммаГанта1Таблица.ТекущаяСтрока = ЗначениеДиаграммы.Идентификатор;
					Элементы.ДиаграммаГанта1Таблица.Свернуть(ЗначениеДиаграммы.Идентификатор);
				КонецЕсли;
				Сч = Сч + 1;
			КонецЦикла;
		КонецЕсли;
	Иначе
		Для каждого Точка Из ДиаграммаГанта.Точки Цикл
			ДиаграммаГанта.СвернутьТочку(Точка, Истина);
		КонецЦикла;
		Для каждого Ид Из ДеревоСостояний.ПолучитьЭлементы() Цикл
			Элементы.ДеревоСостояний.Свернуть(Ид.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МасштабГантаПриИзменении(Элемент)
	Если МасштабГанта = 0 Тогда
		ДиаграммаГанта.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Авто;
	ИначеЕсли МасштабГанта = 1 Тогда
		ДиаграммаГанта.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.ВсеДанные;
	ИначеЕсли МасштабГанта = 2 Тогда
		ДиаграммаГанта.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Период;
		ДиаграммаГанта.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Год;
	ИначеЕсли МасштабГанта = 3 Тогда
		ДиаграммаГанта.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Период;
		ДиаграммаГанта.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Квартал;
	ИначеЕсли МасштабГанта = 4 Тогда
		ДиаграммаГанта.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Период;
		ДиаграммаГанта.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Месяц;
	ИначеЕсли МасштабГанта = 5 Тогда
		ДиаграммаГанта.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Период;
		ДиаграммаГанта.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Неделя;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	КодВозврата = ПроверитьЗаполнениеРеквизитов();
	Если КодВозврата = 0 Тогда 
		ДокументВыводаДиаграммы = Новый ТабличныйДокумент();
		ПечатьНаСервере(ДокументВыводаДиаграммы);
		// выведем на печать
		ДокументВыводаДиаграммы.ОтображатьСетку     = Ложь;
		ДокументВыводаДиаграммы.ОтображатьЗаголовки = Истина;
		ДокументВыводаДиаграммы.ТолькоПросмотр      = Истина;
		ДокументВыводаДиаграммы.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
		ДокументВыводаДиаграммы.Показать();
	Иначе 
		Если КодВозврата = 1 Тогда 
			ТекстОшибки = НСтр("en='Begin of report cannot be greater than end period.';ru='Период начала отчета не может быть больше периода окончания.'");
		Иначе
			ТекстОшибки = НСтр("en='no data for print.';ru='отсутствуют данные для печати.'") + Символы.ПС 
				+ НСтр("en='Maybe the report not formed yet.';ru='Возможно отчет еще не сформирован.'");
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ИзменитьИнтерфейсДиаграммы(Команда)
	Если ИспользуетсяНовыйИнтерфейс Тогда
		Элементы.ГруппаСостояниеНовыйИнтерфейс.Видимость = Ложь;
		Элементы.ГруппаСостояниеСтарыйИнтерфейс.Видимость = Истина;
		ИспользуетсяНовыйИнтерфейс = Ложь;
	Иначе
		Элементы.ГруппаСостояниеНовыйИнтерфейс.Видимость = Истина;
		Элементы.ГруппаСостояниеСтарыйИнтерфейс.Видимость = Ложь;
		ИспользуетсяНовыйИнтерфейс = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФлажокЛегендаПриИзменении(Элемент)
	ФлажокЛегендаПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция ДобавитьВСписокСозданияДокументов(ДокументСтрока)
	Если ДокументСтрока = "такЗаказТакси" Тогда
		Если НЕ (уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
			И Константы.такИспользоватьЗаказыТакси.Получить() = Истина) Тогда
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ДокументСтрока = "такАрендаТС" Тогда
		Если НЕ (уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
			И Константы.такИспользоватьАрендуТС.Получить() = Истина) Тогда
			Возврат Ложь;
		КонецЕсли
	КонецЕсли;
	
	Документ = Метаданные.Документы.Найти(ДокументСтрока);
	Если ПравоДоступа("Добавление", Документ) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СинхронизироватьОтборы(ТекДанные) 
	
	Если ТекДанные.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидМоделиТС") Тогда	
		СписокВыбранныхВидовМоделей = ТекДанные.ПравоеЗначение;
		ОтборОборудования = Ложь;
		ОтборПрицепов = Ложь;
		
		Для Каждого ТекВидМодели Из СписокВыбранныхВидовМоделей Цикл
			
			Если ТекВидМодели.Значение = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Оборудование") Тогда
				ОтборОборудования = Истина; 
			ИначеЕсли ТекВидМодели.Значение = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Прицеп") Тогда
				ОтборПрицепов = Истина;
			КонецЕсли;
			
		КонецЦикла; 
		
		Если ОтборПрицепов И ОтборОборудования Тогда
			ОтображатьОборудованиеПрицепы = Истина; 
		Иначе
			ОтображатьОборудованиеПрицепы = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетКомпоновки()   
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаКомпоновки");
КонецФункции

&НаСервере
Процедура ЗагрузитьНастройки()
	
	ДатаНач      = НачалоМесяца(ТекущаяДата());
	ДатаКон      = КонецМесяца(ТекущаяДата());
	//МасштабГанта = 1;
	Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
		
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	Если ДатаНач = '00010101' ИЛИ ДатаКон = '00010101' Тогда
		ТекстНСТР = НСтр("en='Not specified period of diagram!';ru='Не указан период построения диаграммы!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Возврат;
	КонецЕсли;
	Если ДатаНач > ДатаКон Тогда
		ТекстНСТР = НСтр("en='The start date cannot be greater than period end date!';ru='Дата начала периода не может быть больше даты конца периода!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Возврат;
	КонецЕсли;
	
	СформироватьОтчетНаСервере();
		
	// развернуть дерево
	Для Каждого ТекСтрока Из ДеревоСостояний.ПолучитьЭлементы() Цикл
		Элементы.ДеревоСостояний.Развернуть(ТекСтрока.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
	МасштабГантаПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	ДеревоДанных = ПостроитьДеревоДанных();
	
	Если ВариантПросмотраДиаграммы = 0 Тогда
		ПостроитьДеревоСостояний(ДеревоДанных);
		ПостроитьДиаграммуГантаИерархически(ДеревоДанных, ЭтаФорма.ДиаграммаГанта);
	Иначе  
		ПостроитьДиаграммуГантаБезИерархии(ДеревоДанных, ЭтаФорма.ДиаграммаГанта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПостроитьДеревоДанных()
	ДеревоДанных = Новый ДеревоЗначений;
	
	Настройки = НастройкиКомпоновки.ПолучитьНастройки();
	
	Для Каждого ТекПараметр Из Настройки.ПараметрыДанных.Элементы Цикл 
		Если ТекПараметр.Параметр = Новый ПараметрКомпоновкиДанных("ДатаНач") Тогда 
			ТекПараметр.Значение = ДатаНач;
			ТекПараметр.Использование = Истина;
		КонецЕсли;
		Если ТекПараметр.Параметр = Новый ПараметрКомпоновкиДанных("ДатаКон") Тогда 
			ТекПараметр.Значение = ?(ДатаКон = '00010101', '39991231', КонецДня(ДатаКон));
			ТекПараметр.Использование = Истина;
		КонецЕсли;
		Если ТекПараметр.Параметр = Новый ПараметрКомпоновкиДанных("Организация") Тогда 
			ТекПараметр.Значение = Организация;
			ТекПараметр.Использование = Истина;
		КонецЕсли;
		Если ТекПараметр.Параметр = Новый ПараметрКомпоновкиДанных("ОтображатьНеактивныеТС") Тогда 
			ТекПараметр.Значение = ФлажокНеактивныеТС;
			ТекПараметр.Использование = Истина;
		КонецЕсли;
		Если ТекПараметр.Параметр = Новый ПараметрКомпоновкиДанных("ОтображатьВыбывшиеТС") Тогда 
			ТекПараметр.Значение = ФлажокВыбывшиеТС;
			ТекПараметр.Использование = Истина;
		КонецЕсли;
		Если ТекПараметр.Параметр = Новый ПараметрКомпоновкиДанных("ВидыМоделейТС") Тогда 
			ТекПараметр.Значение = МассивМоделейТСОтбор;
			ТекПараметр.Использование = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	
	ТекМакетКомпоновки = ПолучитьМакетКомпоновки();
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ТекМакетКомпоновки, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	ПроцессорВывода.УстановитьОбъект(ДеревоДанных);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ОбработатьДеревоДанных(ДеревоДанных);
	
	Возврат ДеревоДанных;
КонецФункции 

&НаСервере
Процедура ОбработатьДеревоДанных(ДеревоДанных)
	
	СтрокиИнтерваловДляУдаления = Новый Массив;
	СтрокиСостоянийДляУдаления = Новый Массив;
	СтрокиТСДляУдаления = Новый Массив;
	
	Для каждого ТекТС Из ДеревоДанных.Строки Цикл
		СтрокиСостоянийДляУдаления.Очистить();
		Для каждого ТекСостояние Из ТекТС.Строки Цикл
			СтрокиИнтерваловДляУдаления.Очистить();
			Для каждого ТекИнтервал Из ТекСостояние.Строки Цикл
				Если ТекИнтервал.ПериодОкончание = Дата("20991231") Тогда
					ТекИнтервал.ПериодОкончание = НайтиДатуНачалаНовогоСостояния(ТекИнтервал.ПериодНачало, ТекТС.Строки);
					Если ДатаНач > ТекИнтервал.ПериодОкончание Тогда
						СтрокиИнтерваловДляУдаления.Добавить(ТекИнтервал);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Для каждого ТекСтрока Из СтрокиИнтерваловДляУдаления Цикл
				ТекСостояние.Строки.Удалить(ТекСтрока);
			КонецЦикла;
			Если ТекСостояние.Строки.Количество() = 0 Тогда
				СтрокиСостоянийДляУдаления.Добавить(ТекСостояние);
			КонецЕсли;
		КонецЦикла;
		Для каждого ТекСтрока Из СтрокиСостоянийДляУдаления Цикл
			ТекТС.Строки.Удалить(ТекСтрока);
		КонецЦикла;
		Если ТекТС.Строки.Количество() = 0 Тогда
			СтрокиТСДляУдаления.Добавить(ТекТС);
		КонецЕсли;
	КонецЦикла;
	Для каждого ТекСтрока Из СтрокиТСДляУдаления Цикл
		ДеревоДанных.Строки.Удалить(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграммуГантаБезИерархии(ДеревоДанных, Диаграмма, Печать = Ложь)
	СоответствиеСтрокаСсылка.Очистить();
	ФлажокЛегендаПриИзмененииНаСервере();
	Диаграмма.Очистить(); 
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	Диаграмма.УстановитьПолныйИнтервал(ДатаНач, КонецДня(ДатаКон));
	Для Каждого ТекСостояние Из ДеревоДанных.Строки Цикл  
		Если ТекСостояние.Состояние = NULL Тогда
			Продолжить;
		КонецЕсли;
		
		СерияСостояние = Диаграмма.УстановитьСерию(ТекСостояние.Состояние);
		СерияСостояние.Текст = ТекСостояние.Состояние;
		СерияСостояние.Расшифровка = ТекСостояние.Состояние;
		ЦветИнтервала = ТекСостояние.Состояние.ЦветСостояния.Получить();
		Если ТипЗнч(ЦветИнтервала) = Тип("Цвет") Тогда
			Если ЦветИнтервала.Вид <> ВидЦвета.WebЦвет Тогда
				ЦветИнтервала = WebЦвета.Черный;
			КонецЕсли;
		Иначе
			ЦветИнтервала = WebЦвета.Черный;
		КонецЕсли;
		СерияСостояние.Цвет = ЦветИнтервала;
		Для Каждого ТекТС Из ТекСостояние.Строки Цикл 
			ТочкаТС = Диаграмма.УстановитьТочку(ТекТС.ТС);
			Если ЗначениеЗаполнено(ТекТС.ТС.ДатаВыбытия) Тогда
				ПредставлениеТС = Строка(ТекТС.ТС) + " (выбыло)";
			Иначе
				ПредставлениеТС = Строка(ТекТС.ТС);
			КонецЕсли;
			ТочкаТС.Текст	= ПредставлениеТС;
			ТочкаТС.Расшифровка = ТекТС.ТС;
			
			НоваяСтрока = СоответствиеСтрокаСсылка.Добавить();
			НоваяСтрока.Строка = ПредставлениеТС;
			НоваяСтрока.Ссылка = ТекТС.ТС;
			
			Для Каждого ТекПериод Из ТекТС.Строки Цикл  
				
				ПредставлениеСостояния = Строка(ТекПериод.Состояние.КраткоеНаименование);
				Если Найти(Строка(ТекПериод.Основание),"<Объект не найден>") = 0 Тогда
					ПредставлениеОснования = Строка(ТекПериод.Основание);
				Иначе
					ПредставлениеОснования = НСтр("en='Object is unavailable';ru='Объект недоступен'");
				КонецЕсли;
				
				НоваяСтрока = СоответствиеСтрокаСсылка.Добавить();
				НоваяСтрока.Строка = ПредставлениеСостояния;
				НоваяСтрока.Ссылка = ТекПериод.Состояние;
				
				ЗначениеПериод                  = Диаграмма.ПолучитьЗначение(ТочкаТС, СерияСостояние);
				
				Если ЗначениеЗаполнено(ЗначениеПериод.Текст) Тогда
					
					НоваяСтрока = СоответствиеСтрокаСсылка.НайтиСтроки(Новый Структура("Строка", ЗначениеПериод.Текст))[0];
					
					СписокСсылок = ?(ТипЗнч(НоваяСтрока.Ссылка) = Тип("СписокЗначений"), НоваяСтрока.Ссылка, Новый СписокЗначений);
					Если СписокСсылок.Количество() = 0 Тогда
						СписокСсылок.Добавить(НоваяСтрока.Ссылка);
					КонецЕсли;
					СписокСсылок.Добавить(ТекПериод.Основание);
					
					ЗначениеПериод.Текст = ЗначениеПериод.Текст + ", " + ПредставлениеОснования;
					
					НоваяСтрока.Строка = ЗначениеПериод.Текст;
					НоваяСтрока.Ссылка = СписокСсылок;
					
				Иначе
					
					ЗначениеПериод.Текст = ПредставлениеОснования;
					
					НоваяСтрока = СоответствиеСтрокаСсылка.Добавить();
					НоваяСтрока.Строка = ЗначениеПериод.Текст;
					НоваяСтрока.Ссылка = ТекПериод.Основание;
					
				КонецЕсли;
				
				Если Не Печать Или ИспользуетсяНовыйИнтерфейс Тогда
					Если ЗначениеЗаполнено(ЗначениеПериод.Данные.Начало) Тогда
						ЗначениеПериод.Данные.Начало = Мин(ТекПериод.ПериодНачало, ЗначениеПериод.Данные.Начало);
					Иначе
						ЗначениеПериод.Данные.Начало = ТекПериод.ПериодНачало;
					КонецЕсли;
					ЗначениеПериод.Данные.Окончание = Макс(ТекПериод.ПериодОкончание, ЗначениеПериод.Данные.Начало);
				КонецЕсли;
				Интервал                        = ЗначениеПериод.Добавить();
				Интервал.Начало                 = ТекПериод.ПериодНачало;
				Интервал.Конец                  = ТекПериод.ПериодОкончание;   
				
				Интервал.Текст = ПредставлениеСостояния;
					
				Интервал.Расшифровка = ТекПериод.Основание;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Диаграмма.ПоказатьУровеньТочек(1);
	ДиаграммаГанта.ОбластьПостроения.Заголовок = "ТС";
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграммуГантаИерархически(ДеревоДанных, Диаграмма, Печать = Ложь)
	СоответствиеСтрокаСсылка.Очистить();
	ФлажокЛегендаПриИзмененииНаСервере();
	Диаграмма.Очистить();
	
	Если ДеревоДанных.Строки.Количество() = 0 Тогда
		//ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
		//ДиаграммаГанта.УстановитьПолныйИнтервал(ТекущаяДата(), ТекущаяДата());
		Возврат;
	КонецЕсли;
	
	Диаграмма.ОтображатьПустыеЗначения = Ложь;
	//ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Истина;
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	Диаграмма.УстановитьПолныйИнтервал(ДатаНач, КонецДня(ДатаКон));
	
	СерияТС = Диаграмма.УстановитьСерию("ТС", Неопределено);
	СерияТС.ПриоритетЦвета = Ложь;
	СерияТС.Цвет = WebЦвета.Белый;
	СерияТС.Текст = " ";
	Диаграмма.Обновление = Ложь;
	Диаграмма.ОбластьЛегенды.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, 0);
	Диаграмма.ОбластьЛегенды.ЦветРамки = WebЦвета.Белый;
	
	ЦветаДиаграммы = РаскраскаДиаграммы();
	
	//ТС
	Для Каждого ВыборкаТС Из ДеревоДанных.Строки Цикл 
		
		Если ЗначениеЗаполнено(ВыборкаТС.ТС.ДатаВыбытия) Тогда
			ПредставлениеТС = Строка(ВыборкаТС.ТС) + " (выбыло)";
		Иначе
			ПредставлениеТС = Строка(ВыборкаТС.ТС);
		КонецЕсли;
		
		ТочкаТС = Диаграмма.УстановитьТочку(ПредставлениеТС);
		ТочкаТС.Текст = ПредставлениеТС;
		ТочкаТС.ПриоритетЦвета = Истина;
		ТочкаТС.Цвет = ЦветаДиаграммы["ТемноБирюзовый"];
		ТочкаТС.ДополнительныйЦвет = ЦветаДиаграммы["ТемноКрасный"];
		ТочкаТС.Расшифровка = ВыборкаТС.ТС;
		
		НоваяСтрока = СоответствиеСтрокаСсылка.Добавить();
		НоваяСтрока.Строка = ТочкаТС.Значение;
		НоваяСтрока.Ссылка = ВыборкаТС.ТС;
		
		ЗначениеТочкаТС = Диаграмма.ПолучитьЗначение(ТочкаТС, СерияТС);
		
		//Состояния
		Для Каждого ВыборкаСостояния Из ВыборкаТС.Строки Цикл
			Если ВыборкаСостояния.Состояние = NULL Тогда
				Продолжить;
			КонецЕсли;
			
			ПредставлениеСостояние = Строка(ВыборкаСостояния.Состояние);
			КраткоеНаименованиеСостояние = Строка(ВыборкаСостояния.Состояние.КраткоеНаименование);
					
			ТочкаСостояние = Диаграмма.УстановитьТочку(ПредставлениеТС + " " + ПредставлениеСостояние, ТочкаТС.Значение);
			ТочкаСостояние.Текст = ПредставлениеСостояние;
			ТочкаСостояние.ПриоритетЦвета = Истина;
			
			СерияСостояние = Диаграмма.УстановитьСерию(ВыборкаСостояния.Состояние);
			СерияСостояние.Текст = СерияСостояние.Значение;
			
			Если ЗначениеЗаполнено(ПредставлениеСостояние) Тогда
				ТочкаСостояние.Цвет = ЦветаДиаграммы[ПредставлениеСостояние];
				СерияСостояние.Цвет = ЦветаДиаграммы[ПредставлениеСостояние];
			Иначе
				ТочкаСостояние.Цвет = WebЦвета.Черный;
				СерияСостояние.Цвет = WebЦвета.Черный;
			КонецЕсли;
			ТочкаСостояние.ДополнительныйЦвет = ЦветаДиаграммы["Красный"];
			ТочкаСостояние.Расшифровка = ВыборкаСостояния.Состояние;
			
			ЗначениеТочкаСостояние = Диаграмма.ПолучитьЗначение(ТочкаСостояние, СерияТС);
			
			НоваяСтрока = СоответствиеСтрокаСсылка.Добавить();
			НоваяСтрока.Строка = ТочкаСостояние.Текст;
			НоваяСтрока.Ссылка = ВыборкаСостояния.Состояние;
			
			//Периоды
			Для Каждого ВыборкаПериоды Из ВыборкаСостояния.Строки Цикл
				ДатаНачалаИнтервала = Макс(ВыборкаПериоды.ПериодНачало, ДатаНач);
				ДатаКонцаИнтервала = Мин(ВыборкаПериоды.ПериодОкончание, ДатаКон);
				Если Найти(Строка(ВыборкаПериоды.Основание),"<Объект не найден>") = 0 Тогда
					ПредставлениеОснования = Строка(ВыборкаПериоды.Основание);
				Иначе
					ПредставлениеОснования = НСтр("en='Object is unavailable';ru='Объект недоступен'");
				КонецЕсли;
				
				Если Не Печать Или ИспользуетсяНовыйИнтерфейс Тогда     
					Если ЗначениеЗаполнено(ЗначениеТочкаСостояние.Данные.Начало) Тогда
						ЗначениеТочкаСостояние.Данные.Начало = Мин(ВыборкаПериоды.ПериодНачало, ЗначениеТочкаСостояние.Данные.Начало);
					Иначе
						ЗначениеТочкаСостояние.Данные.Начало = ВыборкаПериоды.ПериодНачало;
					КонецЕсли;
					ЗначениеТочкаСостояние.Данные.Окончание = Макс(ВыборкаПериоды.ПериодОкончание, ЗначениеТочкаСостояние.Данные.Начало);
					
					Если ЗначениеЗаполнено(ЗначениеТочкаТС.Данные.Начало) Тогда
						ЗначениеТочкаТС.Данные.Начало    = Мин(ВыборкаПериоды.ПериодНачало, ЗначениеТочкаТС.Данные.Начало);
					Иначе
						ЗначениеТочкаТС.Данные.Начало = ВыборкаПериоды.ПериодНачало;
					КонецЕсли;
					ЗначениеТочкаТС.Данные.Окончание = Макс(ВыборкаПериоды.ПериодОкончание, ЗначениеТочкаТС.Данные.Окончание);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЗначениеТочкаСостояние.Текст) Тогда
					
					НоваяСтрока = СоответствиеСтрокаСсылка.НайтиСтроки(Новый Структура("Строка", ЗначениеТочкаСостояние.Текст))[0];
					
					СписокСсылок = ?(ТипЗнч(НоваяСтрока.Ссылка) = Тип("СписокЗначений"), НоваяСтрока.Ссылка, Новый СписокЗначений);
					Если СписокСсылок.Количество() = 0 Тогда
						СписокСсылок.Добавить(НоваяСтрока.Ссылка);
					КонецЕсли;
					СписокСсылок.Добавить(ВыборкаПериоды.Основание);
					
					ЗначениеТочкаСостояние.Текст = ЗначениеТочкаСостояние.Текст + ", " + ПредставлениеОснования;
					
					НоваяСтрока.Строка = ЗначениеТочкаСостояние.Текст;
					НоваяСтрока.Ссылка = СписокСсылок;
					
				Иначе
					
					ЗначениеТочкаСостояние.Текст = ПредставлениеОснования;
					
					НоваяСтрока = СоответствиеСтрокаСсылка.Добавить();
					НоваяСтрока.Строка = ЗначениеТочкаСостояние.Текст;
					НоваяСтрока.Ссылка = ВыборкаПериоды.Основание;
					
				КонецЕсли;
				
				// Рабочие интервалы
				НовыйИнтервал = ЗначениеТочкаСостояние.Добавить();
				НовыйИнтервал.Начало = ВыборкаПериоды.ПериодНачало;
				НовыйИнтервал.Конец = ВыборкаПериоды.ПериодОкончание;
				НовыйИнтервал.Расшифровка = ВыборкаПериоды.Основание;  	
				НовыйИнтервал.Текст = КраткоеНаименованиеСостояние;	
				
				
				// Итог по ТС
				НовыйИнтервал = ЗначениеТочкаТС.Добавить();
				НовыйИнтервал.Начало = ВыборкаПериоды.ПериодНачало;
				НовыйИнтервал.Конец = ВыборкаПериоды.ПериодОкончание;
				
				Если ЗначениеЗаполнено(ПредставлениеСостояние) Тогда
					НовыйИнтервал.Цвет = ЦветаДиаграммы[ПредставлениеСостояние];
				Иначе
					ТочкаСостояние.Цвет = WebЦвета.Черный;
				КонецЕсли;
				
				НовыйИнтервал.Расшифровка = ВыборкаПериоды.Основание;
				Если НЕ ПустаяСтрока(НовыйИнтервал.Текст) Тогда
					НовыйИнтервал.Текст = НовыйИнтервал.Текст + ";" + Символы.ПС;
				КонецЕсли; 
				НовыйИнтервал.Текст = НовыйИнтервал.Текст + КраткоеНаименованиеСостояние; 
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	//ДиаграммаГанта.ПоказатьУровеньТочек(0);
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Функция НайтиДатуНачалаНовогоСостояния(НачалоТекСостояния, СостоянияТС)
	Если СостоянияТС.Количество() <> 0 Тогда
		ТС = СостоянияТС[0].ТС;
	Иначе
		Возврат 0;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатСостояниеТС.Период КАК ПериодНачало
	|ИЗ
	|	РегистрСведений.уатСостояниеТС КАК уатСостояниеТС
	|ГДЕ
	|	уатСостояниеТС.ТС = &ТС
	|	И уатСостояниеТС.Период > &Период";
	Запрос.УстановитьПараметр("ТС", ТС);
	Запрос.УстановитьПараметр("Период", НачалоТекСостояния);
	ВыгрузкаИзРегистраСостояний = Запрос.Выполнить().Выгрузить();
	ТаблицаПериодовНачало = Новый ТаблицаЗначений;
	ТаблицаПериодовНачало.Колонки.Добавить("ПериодНачало");
	Для каждого ТекСостояние Из СостоянияТС Цикл
		Для каждого ТекИнтервал Из ТекСостояние.Строки Цикл
			Если ТекИнтервал.ПериодНачало > НачалоТекСостояния Тогда
				НоваяСтрока = ТаблицаПериодовНачало.Добавить();
				НоваяСтрока.ПериодНачало = ТекИнтервал.ПериодНачало;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для каждого СтрокаИзРегистра Из ВыгрузкаИзРегистраСостояний Цикл
		НоваяСтрока = ТаблицаПериодовНачало.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИзРегистра);
	КонецЦикла;
	ТаблицаПериодовНачало.Сортировать("ПериодНачало Возр");
	Для каждого ТекПериодНачало Из ТаблицаПериодовНачало Цикл
		Если ТекПериодНачало.ПериодНачало > НачалоТекСостояния Тогда
			Возврат ТекПериодНачало.ПериодНачало - 1;
		КонецЕсли;
	КонецЦикла;
	Возврат Дата("20991231");
КонецФункции

&НаСервере
Процедура ПостроитьДеревоСостояний(ДеревоДанных)
	ДеревоСостояний_ = РеквизитФормыВЗначение("ДеревоСостояний");;
	
	ДеревоСостояний_.Строки.Очистить();
	
	Для Каждого ВыборкаТС Из ДеревоДанных.Строки Цикл
		НоваяСтрокаТС = ДеревоСостояний_.Строки.Добавить();
		НоваяСтрокаТС.Группировка = Строка(ВыборкаТС.ТС);
		НоваяСтрокаТС.ТС = ВыборкаТС.ТС;
		НоваяСтрокаТС.Уровень = 1;
		
		Для Каждого ВыборкаСостояний Из ВыборкаТС.Строки Цикл
			Если ВыборкаСостояний.Состояние = NULL Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрокаСостояние = НоваяСтрокаТС.Строки.Добавить();
			НоваяСтрокаСостояние.Группировка = ВыборкаСостояний.Состояние;
			НоваяСтрокаСостояние.ТС = ВыборкаТС.ТС;
			НоваяСтрокаСостояние.Состояние = ВыборкаСостояний.Состояние;
			НоваяСтрокаСостояние.Уровень = 2;
						
			Для Каждого ВыборкаДокументы Из ВыборкаСостояний.Строки Цикл
				НоваяСтрокаДокумент = НоваяСтрокаСостояние.Строки.Добавить();
				Если Найти(Строка(ВыборкаДокументы.Основание),"<Объект не найден>") = 0 Тогда
					НоваяСтрокаДокумент.Группировка = КраткоеПредставлениеДокумента(ВыборкаДокументы.Основание);
				КонецЕсли;
				НоваяСтрокаДокумент.ТС = ВыборкаТС.ТС;
				НоваяСтрокаДокумент.Состояние = ВыборкаСостояний.Состояние;
				НоваяСтрокаДокумент.Документ = ВыборкаДокументы.Основание;
				НоваяСтрокаДокумент.Начало = ВыборкаДокументы.ПериодНачало;
				НоваяСтрокаДокумент.Окончание = ВыборкаДокументы.ПериодОкончание;
				НоваяСтрокаДокумент.Уровень = 3;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоСостояний_, "ДеревоСостояний");
КонецПроцедуры

&НаСервере
Функция КраткоеПредставлениеДокумента(ДокСсылка)
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		Рез = НСтр("en='Waybill';ru='Пут. лист'") + " " + ДокСсылка.Номер;
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.уатРемонтныйЛист") Тогда
		Рез = НСтр("en='Rep. list';ru='Рем. лист'") + " " + ДокСсылка.Номер;
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.уатКорректировкаЗаписейРегистров") Тогда
		Рез = НСтр("en='Correct.';ru='Коррект.'") + " " + ДокСсылка.Номер;
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.уатРазнарядка") Тогда
		Рез = НСтр("en='Daily vehicles plan';ru='Разнарядка'") + " " + ДокСсылка.Номер;
	ИначеЕсли ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.уатДиспозицияТС") Тогда
		Рез = НСтр("en='Disposition';ru='Диспозиция'") + " " + ДокСсылка.Номер;
	Иначе
		Рез = "" + ДокСсылка;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

&НаСервере
Функция РаскраскаДиаграммы()
	РезСтруктура = Новый Соответствие;
	
	РезСтруктура.Вставить("ТемноБирюзовый", WebЦвета.ЛимонноЗеленый);
	РезСтруктура.Вставить("ТемноКрасный", WebЦвета.Малиновый);
	РезСтруктура.Вставить("Красный", WebЦвета.Красный); 
	
	ВыборкаСостояний = Справочники.уатСостояниеТС.Выбрать(); 
	
	Пока ВыборкаСостояний.Следующий() Цикл
		Если Не ВыборкаСостояний.ЭтоГруппа И Не ВыборкаСостояний.ПометкаУдаления Тогда
			ТекЦветСостояния           = ВыборкаСостояний.ЦветСостояния.Получить(); 
			ТекПредставлениеСостояния  = Строка(ВыборкаСостояний.Ссылка);
			РезСтруктура.Вставить(ТекПредставлениеСостояния, ТекЦветСостояния);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезСтруктура;
КонецФункции

&НаСервере
Процедура НастроитьОтборПоВидамМоделейТС() 
	МассивВидовТСПоУмолчанию = Новый Массив();
	МассивВидовТСПоУмолчанию.Добавить(Перечисления.уатВидыМоделейТС.Автотранспорт);
	МассивВидовТСПоУмолчанию.Добавить(Перечисления.уатВидыМоделейТС.ЖДТранспорт);
	МассивВидовТСПоУмолчанию.Добавить(Перечисления.уатВидыМоделейТС.Прицеп);
	МассивВидовТСПоУмолчанию.Добавить(Перечисления.уатВидыМоделейТС.Оборудование);
	
	МассивМоделейТСОтбор.ЗагрузитьЗначения(МассивВидовТСПоУмолчанию);
	
КонецПроцедуры  

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	
	// Варианты кодов: 0 - ошибок нет, 1 - ошибка дат, 2 - диаграмма не сформирована
	КодВозврата = 0;
	
	Если ДатаНач > ?(ДатаКон = '00010101', '39991231', КонецДня(ДатаКон)) Тогда 
		КодВозврата = 1;
	ИначеЕсли ДиаграммаГанта.Серии.Количество() = 0 Тогда 
		КодВозврата = 2;
	КонецЕсли;
	
	Возврат КодВозврата;
	
КонецФункции 

&НаСервере
Процедура ПечатьНаСервере(ДокументВыводаДиаграммы)  
	
	ДокументВыводаДиаграммы = Новый ТабличныйДокумент(); 
	ОблДиаграммы = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ДиаграммаГанта").ПолучитьОбласть("ОбластьДиаграммыГанта");
	
	Результат = ПостроитьДеревоДанных();
	
	мДатаКон = ?(ДатаКон = '00010101', '39991231', КонецДня(ДатаКон));
	
	// Устанавливаем заголовок диаграммы
	ОблДиаграммы.Область(1,2,1,2).Текст = "Планирование работы ТС за период " + ПредставлениеПериода(ДатаНач, мДатаКон);
	ДокументВыводаДиаграммы.Вывести(ОблДиаграммы);
	
	ДиаграммаПечати = ДокументВыводаДиаграммы.Рисунки.ДиаграммаГанта.Объект;
	ДиаграммаПечати.ОбластьПостроения.Заголовок = "ТС";
	
	Если ИспользуетсяНовыйИнтерфейс Тогда
		КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя); 
		ОписаниеТипаДата  = Новый ОписаниеТипов("Дата",,,,,КвалификаторыДаты);
		ДиаграммаПечати.КолонкиДанных.Добавить("Начало", ОписаниеТипаДата);
		ДиаграммаПечати.КолонкиДанных.Добавить("Окончание", ОписаниеТипаДата);
	КонецЕсли;
	
	// Копируем свойства диаграммы
	Попытка
		ЗаполнитьЗначенияСвойств(ДиаграммаПечати, ДиаграммаГанта, , "Обновление");
	Исключение
		ЗаполнитьЗначенияСвойств(ДиаграммаПечати, ДиаграммаГанта, , "Обновление,СерияНаОсиТочек");
	КонецПопытки;
	
	ДиаграммаПечати.ОтображатьЗаголовок = Ложь;
	
	// Установим полный интервал
	Если НЕ ДиаграммаПечати.АвтоОпределениеПолногоИнтервала Тогда
		ДиаграммаПечати.УстановитьПолныйИнтервал(ДиаграммаГанта.НачалоПолногоИнтервала, ДиаграммаГанта.КонецПолногоИнтервала);
	КонецЕсли;   
	
	Если ВариантПросмотраДиаграммы = 0 Тогда
		ПостроитьДиаграммуГантаИерархически(Результат, ДиаграммаПечати, Истина);
	Иначе  
		ПостроитьДиаграммуГантаБезИерархии(Результат, ДиаграммаПечати, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТекРелизПлатформы()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;
	РелизПлатформы = Число(Сред(ВерсияПлатформы, 5, 2));
	Возврат РелизПлатформы;
	
КонецФункции 

&НаКлиенте
Процедура УстановитьВариантИнтерфейса(РелизПлатформы)
	
	Если РелизПлатформы >= 21 Тогда
		Элементы.ГруппаСостояниеСтарыйИнтерфейс.Видимость = Ложь;  
		ИспользуетсяНовыйИнтерфейс = Истина;
		
		ПользовательВиделПредупреждение = Ложь;
		ЗагрузитьНастройкиФормы(ПользовательВиделПредупреждение); 
		Если Не ПользовательВиделПредупреждение Тогда
			ТекстНСтр = НСтр("ru = 'Установлен новый режим отображения диаграммы Ганта. В новом режиме таблица со списком документов отображается непосредственно в области построения диаграммы. Вернуться к старому интерфейсу можно в меню %1 на командной панели формы. Через несколько релизов прежний вариант интерфейса будет отключен.'; en = ""A new Gantt chart display mode has been installed. In this mode, the document list table is displayed directly in the chart plotting area. You can revert to the old interface using the %1 menu on the form's command bar. The previous interface will be disabled in a few releases.""");
			ТекстНСтр = СтрШаблон(ТекстНСтр, """Еще""");
			ПоказатьПредупреждение(, ТекстНСтр);
			ПользовательВиделПредупреждение = Истина;
			СохранитьНастройкиФормы(ПользовательВиделПредупреждение);
		КонецЕсли;
	Иначе
		Элементы.ГруппаСостояниеНовыйИнтерфейс.Видимость = Ложь;
		Элементы.ФормаИзменитьИнтерфейсДиаграммы.Видимость = Ложь;
		ИспользуетсяНовыйИнтерфейс = Ложь;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ЗагрузитьНастройкиФормы(ПользовательВиделПредупреждение, ФлажокЛегенда = Неопределено)
	
	Если Не ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда 
		Возврат;
	КонецЕсли; 
	
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить(
	"Обработка.уатПланирваниеРаботыТС.Формы.ОсновнаяФорма",
	"НастройкиФормы"); 
	
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		Если СтруктураНастроек.Свойство("ПредупреждениеПоказано") И СтруктураНастроек.ПредупреждениеПоказано Тогда
			ПользовательВиделПредупреждение = Истина;
		КонецЕсли;
		Если СтруктураНастроек.Свойство("ФлажокЛегенда") Тогда
			ФлажокЛегенда = СтруктураНастроек.ФлажокЛегенда;
		Иначе
			ФлажокЛегенда = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормы(ПользовательВиделПредупреждение, ФлажокЛегенда = Неопределено) 
	
	Если Не ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("ПредупреждениеПоказано", ПользовательВиделПредупреждение);
	Если ФлажокЛегенда <> Неопределено Тогда
		СтруктураНастроек.Вставить("ФлажокЛегенда", ФлажокЛегенда);
	КонецЕсли;
	
	ХранилищеНастроекДанныхФорм.Сохранить(
		"Обработка.уатПланирваниеРаботыТС.Формы.ОсновнаяФорма", 
		"НастройкиФормы", СтруктураНастроек);

	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиВариантаОтчета()  
	
	МакетКомпоновки  = ПолучитьМакетКомпоновки();
	URLСхемы         = ПоместитьВоВременноеХранилище(МакетКомпоновки, УникальныйИдентификатор);
	
	НастройкиКомпоновки.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы));
	
	Если ВариантПросмотраДиаграммы = 0 Тогда  
		НастройкиКомпоновки.ЗагрузитьНастройки(МакетКомпоновки.ВариантыНастроек.Основной.Настройки);	
	Иначе 
		НастройкиКомпоновки.ЗагрузитьНастройки(МакетКомпоновки.ВариантыНастроек.БезИерархии.Настройки);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНастройкиОтбораПриСменеВариантаОтчета(ПереносимыеЭлементыОтбора)
	
	ТекущиеЭлементыОтбора = НастройкиКомпоновки.Настройки.Отбор.Элементы;
	ТекущиеЭлементыОтбора.Очистить();
	
	Для Каждого ЭлементОтбора Из ПереносимыеЭлементыОтбора Цикл
		НовыйОтбор = ТекущиеЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЗаполнитьЗначенияСвойств(НовыйОтбор, ЭлементОтбора);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СвернутьРазвернутьНаСервере()
	ДиаграммаГанта.ПоказатьУровеньТочек(0);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьПравуюТЧ()
	Если ИспользуетсяНовыйИнтерфейс Тогда
	КоличествоТочек = ДиаграммаГанта.Точки.Количество();
		Если ЗначениеЗаполнено(КоличествоТочек) Тогда
			Для Каждого Точка Из ДиаграммаГанта.Точки Цикл
				Если Точка.Точки.Количество() <> 0 Тогда
					ЗначениеДиаграммы = ДиаграммаГанта.ПолучитьЗначение(Точка, ДиаграммаГанта.Серии[0]);
					Попытка
						Если Элементы.ДиаграммаГанта1Таблица.Развернут(ЗначениеДиаграммы.Идентификатор) Тогда
							ДиаграммаГанта.РазвернутьТочку(Точка, Истина);
						КонецЕсли;
					Исключение;
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ФлажокЛегендаПриИзмененииНаСервере()
	Если ФлажокЛегенда Тогда
		ДиаграммаГанта.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Право;
	Иначе
		ДиаграммаГанта.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	КонецЕсли;
	ПользовательВиделПредупреждение = Ложь;
	ЗагрузитьНастройкиФормы(ПользовательВиделПредупреждение);
	СохранитьНастройкиФормы(ПользовательВиделПредупреждение, ФлажокЛегенда);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыборСсылкиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, Результат.Значение);
	
КонецПроцедуры

#КонецОбласти
